I can't reproduce this issue. Please provide your configuration, and more details.

Here is what I tried:

```hcl
provider "aws" {
  region = "us-east-1"
}

resource "aws_security_group" "allow_egress" {
  name = "allow_egress"

  egress {
    from_port   = 0
    to_port     = 0
    protocol    = "-1"
    cidr_blocks = ["0.0.0.0/0"]
  }
}

resource "aws_security_group" "allow_ingress_ssh" {
  name = "allow_ingress_ssh"

  ingress {
    from_port   = 22
    to_port     = 22
    protocol    = "tcp"
    cidr_blocks = ["0.0.0.0/0"]
  }
}

resource "aws_instance" "web" {
  ami           = "ami-2757f631"
  instance_type = "t2.micro"

  security_groups = [
    aws_security_group.allow_egress.name,
    aws_security_group.allow_ingress_ssh.name
  ]
}
```

Apply this to create the two security groups and the instance. Then, change the `aws_instance` configuration to remove one of the groups:

```hcl
resource "aws_instance" "web" {
  ami           = "ami-2757f631"
  instance_type = "t2.micro"

  security_groups = [
    aws_security_group.allow_ingress_ssh.name
  ]
}
```

The plan shows that the instance will be replaced:

```text
Terraform will perform the following actions:

  # aws_instance.web must be replaced
-/+ resource "aws_instance" "web" {
        ami                          = "ami-2757f631"
      ~ arn                          = "arn:aws:ec2:us-east-1:201907987408:instance/i-03abbbbd4118073b5" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 1 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
        get_password_data            = false
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-03abbbbd4118073b5" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
        instance_type                = "t2.micro"
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-041d465b4dd6df646" -> (known after apply)
      ~ private_dns                  = "ip-172-31-81-24.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.81.24" -> (known after apply)
      ~ public_dns                   = "ec2-18-207-190-237.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "18.207.190.237" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [ # forces replacement
          - "allow_egress",
            "allow_ingress_ssh",
        ]
        source_dest_check            = true
      ~ subnet_id                    = "subnet-f9458cd8" -> (known after apply)
      - tags                         = {} -> null
      ~ tenancy                      = "default" -> (known after apply)
      ~ volume_tags                  = {} -> (known after apply)
      ~ vpc_security_group_ids       = [
          - "sg-01dce57cd065230ed",
          - "sg-07b8a21e374601dcd",
        ] -> (known after apply)

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ volume_id             = "vol-0768c0103298b380c" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

Note this section of the diff:

```text
      ~ security_groups              = [ # forces replacement
          - "allow_egress",
            "allow_ingress_ssh",
        ]
```